In [1]:
import pandas as pd

In [2]:
titanic_data = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/prework_data/main/titanic.csv')

In [4]:
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
titanic_data.columns # view columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### describe() 
- we can check if data has outliers if mean and median are very different

In [ ]:
titanic_data.describe() #statistical properties of data

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
titanic_data["PassengerId"] # categorical data; meaningless

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [9]:
titanic_data.Sex

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [ ]:
titanic_data.Sex.unique() # map male and female to 0 and 1

array(['male', 'female'], dtype=object)

In [11]:
titanic_data.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [ ]:
titanic_data.Cabin.unique().shape 
# 148 = number of unique values in cabin

(148,)

In [ ]:
titanic_data.Sex.unique().shape # shape counts the number of values

(2,)

In [ ]:
titanic_data.Sex # returns column

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [17]:
titanic_data.Sex.unique()

array(['male', 'female'], dtype=object)

In [ ]:
titanic_data.Cabin.nunique() # doesn't count empty values

147

In [20]:
is_male = titanic_data.Sex == "male"

In [ ]:
titanic_data[is_male] # prints only male data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
titanic_data[is_male].describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,577.000000,577.000000,577.000000,453.000000,577.000000,577.000000,577.000000
mean,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893
std,257.486139,0.391775,0.813580,14.678201,1.061811,0.612294,43.138263
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,222.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,464.000000,0.000000,3.000000,29.000000,0.000000,0.000000,10.500000
75%,680.000000,0.000000,3.000000,39.000000,0.000000,0.000000,26.550000
max,891.000000,1.000000,3.000000,80.000000,8.000000,5.000000,512.329200

In [24]:
titanic_data[is_male].Survived.mean()

np.float64(0.18890814558058924)

In [27]:
is_female = titanic_data.Sex == "female"

In [31]:
titanic_data[titanic_data.Sex == "female"].Survived.mean()

np.float64(0.7420382165605095)

In [36]:
titanic_data[(titanic_data.Sex == "female") & (titanic_data.Age < 18)].Survived.mean() # and opperation

np.float64(0.6909090909090909)

In [ ]:
titanic_data[(titanic_data.Sex == "female") | (titanic_data.Age < 18)].Survived.mean() # or opperation

np.float64(0.6881720430107527)

In [ ]:
titanic_data[(titanic_data.Sex == "male") & (titanic_data.Age >= 18)].Survived.mean() # does not include empty data, we check for age with &

np.float64(0.17721518987341772)

In [ ]:
titanic_data[~((titanic_data.Sex == "female") | (titanic_data.Age < 18))].Survived.mean() # includes empty data for age when female is true

np.float64(0.16570327552986513)

In [42]:
import numpy as np

In [ ]:
np.nan < 18 # tells us

False

In [46]:
gropued_data = titanic_data.groupby(("Sex")) # filters by sex; splits data into sex groups

In [ ]:
gropued_data.Survived.mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [50]:
gropued_data.Survived.agg(["mean", "median", "max", "min", "count"])

            mean  median  max  min  count
Sex
female  0.742038     1.0    1    0    314
male    0.188908     0.0    1    0    577

In [51]:
gropued_data.Age.agg(["mean", "median", "max", "min", "count"])

             mean  median   max   min  count
Sex
female  27.915709    27.0  63.0  0.75    261
male    30.726645    29.0  80.0  0.42    453

In [52]:
gropued_data[["Age", "Survived", "Pclass", "Fare"]].agg(["mean", "median", "max", "min", "count"])

              Age                           Survived                       \
             mean median   max   min count      mean median max min count
Sex
female  27.915709   27.0  63.0  0.75   261  0.742038    1.0   1   0   314
male    30.726645   29.0  80.0  0.42   453  0.188908    0.0   1   0   577

          Pclass                            Fare
            mean median max min count       mean median       max   min count
Sex
female  2.159236    2.0   3   1   314  44.479818   23.0  512.3292  6.75   314
male    2.389948    3.0   3   1   577  25.523893   10.5  512.3292  0.00   577